subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
//************************************************************************************
// Project : ESP32 Universal CC/CV Charger Controller
// Version : v12.0
// Date    : 2024-03-22
//
// Changelog:
//    
//
// Features:
//    - Full hysteresis-based state machine: BULK → ABSORPTION → FLOAT → BACKUP → IDLE → BULK
//    - Charge STATE logic (updateChargeMode) and PWM CONTROL logic (adjustPWM) separated
//    - All hysteresis values from battery_types.h (no magic numbers)
//    - Enforced minimum mode dwell time using existing timing infrastructure
//    - Overvoltage forces BACKUP with hard PWM shutdown
//    - IDLE exit requires both voltage + time hysteresis
//    - Hysteresis and safety limits in battery_types.h
//    - Battery-specific voltage/current hysteresis parameters
//    - Battery-specific bulk/float safety limits
//    - Convenience macros include new parameters
//    - CC/CV charging algorithm for stable DC input
//    - Simplified mode transitions for DC input charging
//    - All safety, UI, and hardware features maintained
//    - Web interface for CC/CV operation
//    - Battery-specific charging profiles preserved
//    - Universal DC Input (12-30V) via stable power supply
//    - Battery sensing via ADS1115 + ACS712 (auto calibration)
//    - Load control (AUTO / MANUAL) with protection
//    - DS18B20 thermal fan control
//    - 20x4 LCD + Web UI, WiFi + mDNS, audible alerts, 24h auto-reboot
//
// Hardware:
//    - MCU    : DOIT ESP32 DEVKIT V1 (38-pin)
//    - ADC    : ADS1115 @5V via bi-directional LLC (GAIN_TWOTHIRDS)
//    - Driver : IR2104 Half-Bridge Driver (Synchronous Buck)
//    - MOSFETs: High-Side N-CH + Low-Side N-CH
//    - Buzzer : Active Buzzer for audible notifications
//    - LLC    : I2C Bi-Directional Logic Level Converter (4-Channel)
//    - Display: 20x4 I2C LCD Screen
//
// Hardware Notes:
//    - INPUT/BAT sensed via shared divider
//      (100k / (17.5k) => (15k + 5k POT)) ~= 6.71x
//    - ACS712 requires zero-current calibration at startup
//    - I2C fixed at 200kHz with GPIO-based bus recovery
//    - PWM limited to user-defined % (70-85%) to ensure IR2104 bootstrap
//      capacitor recharge
//    - PWM resolution is 10-bit
//    - IR2104 SD (Shutdown) pin on GPIO 33
//      Logic: HIGH = Active, LOW = Shutdown (High-Z)
//      Shutdown occurs ONLY in IDLE/BACKUP modes after 10s delay
//    - LCD: 20x4 I2C display at address 0x27
//
//************************************************************************************



//************************************************************************************
// Configuration Flags  {Serial.print -> Enabled/Disabled}
//************************************************************************************
#define ENABLE_SERIAL_DEBUG 1  // 0 = Disabled, 1 = Enabled

//************************************************************************************
// Debug Print Macros
//************************************************************************************
#if ENABLE_SERIAL_DEBUG
#define DEBUG_PRINT(...) Serial.print(__VA_ARGS__)
#define DEBUG_PRINTLN(...) Serial.println(__VA_ARGS__)
#define DEBUG_PRINTF(fmt, ...) Serial.printf(fmt, ##__VA_ARGS__)
#else
#define DEBUG_PRINT(...)
#define DEBUG_PRINTLN(...)
#define DEBUG_PRINTF(fmt, ...)
#endif

//************************************************************************************
// Library Includes
//************************************************************************************
#include <Arduino.h>
#include <Wire.h>                // I2C communication library
#include <Adafruit_ADS1X15.h>    // ADS1115 ADC library
#include <LiquidCrystal_I2C.h>   // I2C LCD library
#include <math.h>                // Mathematical functions
#include <WiFi.h>                // WiFi connectivity library
#include <WiFiManager.h>         // Simplifies WiFi configuration and captive portal
#include <WebServer.h>           // ESP32 Web server library
#include <ESPmDNS.h>             // mDNS for hostname access
#include <Bounce2.h>             // Button debounce library
#include <OneWire.h>             // 1-Wire bus library
#include <DallasTemperature.h>   // DS18B20 temperature sensor library
#include <esp_task_wdt.h>        // ESP32 Task Watchdog Timer library
#include <Preferences.h>         // Flash storage for persistent settings

//************************************************************************************
// Application-specific headers
//************************************************************************************
#include "controller_types.h"
#include "battery_types.h"
#include "fan_control.h"
#include "charger_web.h"
#include "WiFiSignalHelpers.h"
#include "wifi_sys.h"
#include "buzzer_sys.h"

//************************************************************************************
// LEDC Compatibility Macros for ESP32 Core v3.0+
//************************************************************************************
#if ESP_ARDUINO_VERSION_MAJOR >= 3
// In Core v3.0, ledcAttach returns bool and takes (pin, freq, res). Channel is auto-managed.
#define COMPAT_LEDC_ATTACH(pin, channel, freq, res) ledcAttach(pin, freq, res)
// In Core v3.0, ledcWrite takes (pin, duty). Channel is ignored/deprecated.
#define COMPAT_LEDC_WRITE(pin, channel, duty) ledcWrite(pin, duty)
#else
// In Core v2.x, we must manually setup channel and attach pin.
#define COMPAT_LEDC_ATTACH(pin, channel, freq, res) do { ledcSetup(channel, freq, res); ledcAttachPin(pin, channel); } while(0)
// In Core v2.x, ledcWrite takes (channel, duty).
#define COMPAT_LEDC_WRITE(pin, channel, duty) ledcWrite(channel, duty)
#endif

//************************************************************************************
// Global Voltage Range Constants - Fallback Safety Values
//************************************************************************************
const float MIN_BATTERY_VOLTAGE = 10.5f; // Safe fallback for error conditions
const float MAX_BATTERY_VOLTAGE = 12.7f; // Safe fallback for error conditions

//************************************************************************************
// Global LCD Refresh Constants
//************************************************************************************
const int LCD_REFRESH_RATE_MS = 800; // LCD refresh interval in milliseconds
const unsigned long FLASH_CYCLE_MS = 2000UL; // LED flash cycle duration
const unsigned long FLASH_ON_DURATION_MS = 1000UL; // LED flash on duration

//************************************************************************************
// Watchdog Configuration for System Stability
//************************************************************************************
#define WATCHDOG_TIMEOUT 60    // Watchdog timeout in seconds
#define WATCHDOG_FEED_INTERVAL 8000  // Feed watchdog every 8 seconds (conservative)
unsigned long lastWatchdogFeed = 0;

//************************************************************************************
// Non-blocking Delay Structure for Smooth Operation
//************************************************************************************
struct NonBlockingDelay {
  unsigned long previousMillis;

  bool isComplete(unsigned long interval) {
    unsigned long currentMillis = millis();
    if (currentMillis - previousMillis >= interval) {
      previousMillis = currentMillis;
      return true;
    }
    return false;
  }
  void reset() {
    previousMillis = millis();
  }
};

// Create delay instances for different operations
NonBlockingDelay wifiDelay;
NonBlockingDelay sensorDelay;
NonBlockingDelay lcdDelay;
NonBlockingDelay beepDelay;
NonBlockingDelay logDelay;
NonBlockingDelay ipPrintDelay;
NonBlockingDelay watchdogDelay;
NonBlockingDelay eepromDelay; // Kept name for compatibility, used for persistence delays

//************************************************************************************
// Web Server and Global System Variables
//************************************************************************************
WebServer server(80); // Web server running on port 80
Preferences preferences; // Defined globally here for access across functions

// Sensor readings - consolidated global variables
float bat_voltage = 0.0, input_voltage = 0.0, Current_A = 0.0, temperatureC = 0.0;
int pwm_value = 0;
int pwm_last = 0; // Global tracking for soft-start logic

