subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
// System status variables
String mode_str = "(BULK)";
String load_status = "Off";
String loadControlModeStr = "A";
bool load_is_on = false;

// Pin assignments
int load_enable = 5;
LoadControlMode loadControlMode = AUTO;

//************************************************************************************
// SIMULATION_MODE  {Enabled/Disabled}
//************************************************************************************
#define SIMULATION_MODE 1  // 0 = real hardware, 1 = simulation

//************************************************************************************
// LCD and ADC Objects
//************************************************************************************
LiquidCrystal_I2C lcd(0x27, 20, 4);
Adafruit_ADS1115 ads;

//************************************************************************************
// Custom LCD Icons (battery levels + power + PWM symbol)
//************************************************************************************
byte BATTERY_ICON[6][8] = {
  { 0b01110, 0b11011, 0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b11111 },
  { 0b01110, 0b11011, 0b10001, 0b10001, 0b10001, 0b10001, 0b11111, 0b11111 },
  { 0b01110, 0b11011, 0b10001, 0b10001, 0b10001, 0b11111, 0b11111, 0b11111 },
  { 0b01110, 0b11011, 0b10001, 0b11111, 0b11111, 0b11111, 0b11111, 0b11111 },
  { 0b01110, 0b11011, 0b10001, 0b11111, 0b11111, 0b11111, 0b11111, 0b11111 },
  { 0b01110, 0b11111, 0b11111, 0b11111, 0b11111, 0b11111, 0b11111, 0b11111 }
};

#define POWER_ICON 6
byte POWER_ICON_PATTERN[8] = {
  0b11111, 0b10101, 0b11111, 0b10101,
  0b11111, 0b10101, 0b11111, 0b00000
};

#define PWM_ICON 7
byte PWM_ICON_PATTERN[8] = {
  0b11101, 0b10101, 0b10101, 0b10101,
  0b10101, 0b10101, 0b10101, 0b10111
};

//************************************************************************************
// ADS1115 Channel Mapping (AIN0-AIN3)
//************************************************************************************
#define ADS_PIN_CURRENT_SENSOR    0    // AIN0 -> ACS712 Current Sensor Input
#define ADS_PIN_INPUT_VOLTAGE     2    // AIN2 -> DC Input Voltage Measurement
#define ADS_PIN_BATTERY_VOLTAGE   3    // AIN3 -> Battery Voltage Measurement

//************************************************************************************
// Current Sensor (ACS712) Configuration
//************************************************************************************
#define ACS712_VARIANT 5      // 5A module (0.185 V/A). Use 20 or 30 for others.
float ACS_SENSITIVITY = 0;    // Set dynamically in setup()
float MANUAL_OFFSET_CORRECTION = 0.0;

//************************************************************************************
// Voltage Divider Configuration for ADS1115 to Actual Voltage Conversion (0-30V Range)
//************************************************************************************
const float R1 = 100000.0; // Upper resistor value in ohms (100k)
const float R2 = 17500.0;  // Lower resistor value in ohms (17.5k) (15k + 5k POT )
const float dividerFactor = (R1 + R2) / R2; // Scale factor for voltage reading (~6.7143)

//************************************************************************************
// Battery Configuration and Convenience Macros
//************************************************************************************
BatteryType selectedBattery = LEAD_ACID_12V_7AH;
BatteryParams currentBattery = batteryTable[0];

// Core charging voltage macros
#define bulk_voltage_max       currentBattery.bulk_voltage_max
#define bulk_voltage_min       currentBattery.bulk_voltage_min
#define absorption_voltage_max currentBattery.absorption_voltage
#define float_voltage_max      currentBattery.float_voltage_max
#define float_voltage_min      currentBattery.float_voltage_min
#define battery_voltage_min    currentBattery.battery_voltage_min
#define input_voltage_min      currentBattery.input_voltage_min
#define OVERVOLTAGE_CUTOFF     currentBattery.overvoltage_cutoff

// Battery-specific safety limits (v10.5 addition)
#define BULK_SAFETY_LIMIT      currentBattery.bulk_safety_limit
#define FLOAT_SAFETY_LIMIT     currentBattery.float_safety_limit

// Battery-specific hysteresis parameters (v10.5 addition)
#define VOLTAGE_HYSTERESIS     currentBattery.voltage_hysteresis
#define CURRENT_HYSTERESIS     currentBattery.current_hysteresis

//************************************************************************************
// Load Protection Configuration
//************************************************************************************
#define LOAD_PROTECTION_CURRENT 3.5  // Amps - instant cutoff threshold
#define LOAD_OVERCURRENT_COUNT 3       // Number of consecutive readings to confirm overcurrent
#define LOAD_PROTECTION_RESET_TIME 5000UL  // 5 seconds auto-reset time ONLY

//************************************************************************************
// Global Load Protection Variables
//************************************************************************************
bool loadProtectionActive = false;
bool loadWasTripped = false;
unsigned long lastOvercurrentTime = 0;
int overcurrentCount = 0;
bool loadProtectionEnabled = true; // Can be toggled via web UI

// Hiccup Protection Counter
int protectionRetryCount = 0;
const int MAX_PROTECTION_RETRIES = 5; // Max retries before latching off
unsigned long lastRetryResetTime = 0; // Time tracking for retry counter reset
const unsigned long RETRY_RESET_TIMEOUT = 300000UL; // 5 minutes timeout for retry counter reset

//************************************************************************************
// GPIO Pin Assignments for DOIT ESP32 DEVKIT V1
//************************************************************************************
const int LED_CRITICAL  = 26; // Critical battery level LED
const int LED_MEDIUM    = 27; // Medium battery level LED
const int LED_FULL      = 32; // Full battery level LED

