subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
// BUZZER_PIN is now in buzzer_sys.cpp

const int PWM_out       = 25; // PWM output for charge control
const int BATTSTATUS_LED = 14; // Breathing battery status LED

// === IR2104 SAFETY UPDATE ===
// Shutdown (SD) pin assignment for IR2104
// HIGH = Active, LOW = Shutdown (High-Z)
const int DRIVER_SD_PIN = 33;
unsigned long sdShutdownTimer = 0; // Timer for delayed shutdown in IDLE/BACKUP

const int ledChannel    = 1;    // LEDC channel for breathing LED
const int pwmFrequency  = 1000; // PWM frequency for breathing LED
const int pwmResolution = 8;    // PWM resolution for breathing LED

//************************************************************************************
// User-Configurable PWM Safety Limit for IR2104 Bootstrap Safety
// Allowed range: 70% to 85% ONLY to ensure bootstrap capacitor recharge
// ============================================================================
#define PWM_FULL_SCALE_LIMIT 70   // USER VALUE [%] — MUST be 70 to 85

#if (PWM_FULL_SCALE_LIMIT < 70) || (PWM_FULL_SCALE_LIMIT > 85)
#error "PWM_FULL_SCALE_LIMIT must be between 70% and 85% for IR2104 safety"
#endif

#define PWM_FULL_SCALE   1023  // Full 10-bit scale (0-1023)
#define PWM_MAX_DUTY     ((PWM_FULL_SCALE * PWM_FULL_SCALE_LIMIT) / 100) // User-configurable limit

// === IR2104 PWM CONFIGURATION ===
// Standardized to 10-bit (0-1023) for finer logic
// User limit guarantees Bootstrap Refresh (Low-Side ON for [100-LIMIT]% of cycle)
#define PWM_CHANNEL 0
//#define PWM_FREQ 8000 // Max PWM_FREQ 5000
#define PWM_FREQ 20000   // 25 kHz (above human hearing)
#define PWM_RES  10   // 10-bit resolution (0-1023) to match safety limits
// PWM_MAX_DUTY is now calculated above based on user-defined percentage

//************************************************************************************
// Auto-reboot Configuration for System Stability
//************************************************************************************
#define REBOOT_INTERVAL 86400000UL // 24 hours in milliseconds

unsigned long rebootStartTime = 0;
bool rebootNotified = false;
uint32_t lastRebootTime = 0;

//************************************************************************************
// Charge Mode State Machine (Updated for CC/CV)
//************************************************************************************
enum ChargeMode { BULK, ABSORPTION, FLOAT, BACKUP, IDLE };
ChargeMode mode = BULK;

//************************************************************************************
// Safe PWM Write Helper (Updated for IR2104 with User-Configurable Limit)
//************************************************************************************
void writePWMClamped(int duty) {
  // === IR2104 CHANGE ===
  // Strict user-defined % clamp.
  // At max duty (PWM_MAX_DUTY), Low-Side is ON for [100-PWM_FULL_SCALE_LIMIT]% of cycle.
  // This guarantees bootstrap capacitor recharge every cycle.
  int hardware_duty = duty;

  // Global Safety Clamp using user-configurable limit
  if (hardware_duty > PWM_MAX_DUTY) {
    hardware_duty = PWM_MAX_DUTY;
  }

  // Additional safety clamp to prevent negative values
  if (hardware_duty < 0) {
    hardware_duty = 0;
  }

  // Safety: If we are actively driving PWM, ensure SD is HIGH immediately
  if (hardware_duty > 0) {
    digitalWrite(DRIVER_SD_PIN, HIGH);
    sdShutdownTimer = 0; // Reset any pending shutdown timer
  }

  COMPAT_LEDC_WRITE(PWM_out, PWM_CHANNEL, hardware_duty);
}

//************************************************************************************
// Driver SD (Shutdown) State Manager
// Handles the 10-second delay for turning off SD pin in IDLE/BACKUP modes
//************************************************************************************
void manageDriverSD() {
  // If we are in an ACTIVE charging mode (BULK, ABS, FLOAT) OR PWM is running
  if ((mode != IDLE && mode != BACKUP) || pwm_value > 0) {
    digitalWrite(DRIVER_SD_PIN, HIGH); // Force Driver Active
    sdShutdownTimer = 0; // Reset timer
  }
  // If we are in IDLE or BACKUP (and PWM is 0)
  else {
    if (sdShutdownTimer == 0) {
      sdShutdownTimer = millis(); // Start timer
    } else if (millis() - sdShutdownTimer > 10000UL) {
      digitalWrite(DRIVER_SD_PIN, LOW); // Turn OFF Driver after 10s
    }
    // If < 10s, do nothing (Pin remains in last state, typically HIGH)
  }
}

//************************************************************************************
// LCD Timing and Blinking Control
//************************************************************************************
unsigned long last_lcd_update = 0;
unsigned long last_flash_update = 0;
bool mode_visible = true;

//************************************************************************************
// Sensor Filtering Parameters (IIR Filter)
//************************************************************************************
unsigned long lastModeChange = 0;
float filteredTemp = 0.0;

// EMA Filter Response Times (1Hz update):
// ---------------------------------------
// 0.1 = 6.6 seconds to 50%, 22 seconds to 90%
// 0.2 = 3.1 seconds to 50%, 10.3 seconds to 90%
// 0.3 = 1.9 seconds to 50%, 6.5 seconds to 90%
// 0.5 = 1.0 seconds to 50%, 3.3 seconds to 90%
// ---------------------------------------
float ALPHA_V    = 0.3;  // 1.9s to 50%, 6.5s to 90% - Fast voltage tracking
float ALPHA_C    = 0.2;  // 3.1s to 50%, 10s to 90% - Smooth noisy ACS712 current
float ALPHA_TEMP = 0.3;  // 1.9s to 50%, 6.5s to 90% - Responsive temperature control

const float noiseThreshold = 0.05; // Minimum current threshold to filter noise
const float NOISE_HYSTERESIS = 0.01f; // Hysteresis for noise filtering

//************************************************************************************
// ADS1115 Status and ACS712 Reference Values
//************************************************************************************
bool ads_connected = false;
float ACS_OFFSET_VOLTAGE = 2.5; // Default ACS712 zero-current offset voltage

//************************************************************************************
// DS18B20 Temperature Sensor Configuration
//************************************************************************************
#define DS18B20_PIN 4  // OneWire bus pin for DS18B20
OneWire oneWire(DS18B20_PIN);
DallasTemperature ds18b20(&oneWire);
DeviceAddress ds18b20Addr;
bool ds18b20Found = false;
bool tempValid = false;

//************************************************************************************
// Idle Mode Entry Criteria - NOW BATTERY-SPECIFIC
//************************************************************************************
unsigned long idleStartTime = 0;
const float   IDLE_CURRENT_THRESHOLD    = 0.10; // Current threshold for idle mode (A)

unsigned long idleVoltageDropStart = 0;

// Load control debounce parameters
const float battery_voltage_hysteresis = 0.2; // Voltage hysteresis for load switching
unsigned long lastLoadChangeTime = 0;
const unsigned long debounceDelay = 5000; // Load switch debounce delay (ms)

//************************************************************************************
// Buzzer Control
//************************************************************************************
bool pendingLoadChange = false;
bool pendingTurnOn = false;
// Beep Priority Enum is now in controller_types.h
// Core buzzer functions and patterns are now in buzzer_sys.h/cpp

//************************************************************************************
// Button Configuration with Bounce2 Library
//************************************************************************************
const int BUTTON_MODE       = 19; // Battery/load mode toggle button
const int BUTTON_LOAD       = 16; // Load on/off button
const int BUTTON_WIFI_RESET = 15; // WiFi reset/config button
const int BUTTON_CALIBRATE = 17; // Calibration button (startup only)

