subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
  // Calculate median value from sorted samples
  float median = (validCount > 0) ?
                 readings[validCount / 2] : 2.5;

  DEBUG_PRINTF("Calibration: %.3f V\n", median);

  // Display calibration result
  lcd.setCursor(0, 3);
  lcd.print("Result: ");
  lcd.print(median, 3);
  lcd.print("V");

  delay(1500);

  // Save calibration to Preferences with validation
  saveCalibrationOffset(median);
  // Update global offset for immediate use in current measurements
  ACS_OFFSET_VOLTAGE = median;

  lcd.setCursor(0, 3); lcd.print("SAVED:  ");
  lcd.print(median, 3);
  lcd.print("V ");

  DEBUG_PRINTF("Calibration saved: %.3f V\n", median);

  // Three beeps for successful calibration confirmation - guaranteed
  for (int i = 0; i < 3; i++) {
    ensureBeep(200, 200); // Guaranteed success beeps
  }

  delay(1000);

  // Clear LCD and restore normal display with icons
  lcd.clear();
  SETUP_POWER_BATT_ICON();
}

//************************************************************************************
// Automatic Calibration Countdown (10-second window)
// Provides user with opportunity to calibrate during startup
//************************************************************************************
void autoCalibrationCountdown() {
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("Installation Done");
  lcd.setCursor(0, 1); lcd.print("Press to Start Cal");
  buttonCalibrate.update();
  unsigned long countdownStart = millis();
  const unsigned long COUNTDOWN_DURATION = 10000; // 10 seconds
  int lastCountdown = -1;
  bool calibrationTriggered = false;
  while (millis() - countdownStart < COUNTDOWN_DURATION) {
    buttonCalibrate.update();
    // Check for button press to trigger calibration
    if (buttonCalibrate.fell()) {
      ensureBeep(150, 50); // Guaranteed beep for button press
      performCalibration();
      calibrationTriggered = true;
      break;
    }

    // Update countdown display every second
    int remaining = (COUNTDOWN_DURATION - (millis() - countdownStart)) / 1000;
    if (remaining != lastCountdown) {
      lcd.setCursor(0, 2); lcd.print("Time Out in ");
      lcd.print(remaining);
      lcd.print("s ");
      lastCountdown = remaining;

      // Beep for countdown feedback
      if (remaining <= 5) {
        // Use non-blocking force beep for smoother countdown
        startBeepPattern(1, 50, 50, BEEP_PRIORITY_NORMAL, true);
      }
    }

    updateBeepPattern();
    delay(50);
  }

  // If no button press within 10 seconds, continue without calibration
  if (!calibrationTriggered) {
    lcd.setCursor(0, 3);
    lcd.print("Skipping calib...");

    // Three beeps for skip confirmation - guaranteed
    for (int i = 0; i < 3; i++) {
      ensureBeep(100, 100); // Guaranteed skip beeps
    }

    // Show current calibration value to user
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("Current Calibration");
    lcd.setCursor(0, 1); lcd.print("Offset: ");
    lcd.print(ACS_OFFSET_VOLTAGE, 3);
    lcd.print("V");
    lcd.setCursor(0, 2); lcd.print("Starting System...");
    // Print current calibration value to debug
    DEBUG_PRINTF("Skipping calibration. Using current offset: %.3f V\n", ACS_OFFSET_VOLTAGE);

    delay(4000);
    // Restore normal display with icons
    lcd.clear();
    SETUP_POWER_BATT_ICON();
  }
}

//************************************************************************************
// Save Calibration Offset (Migrated to Preferences)
// Implements wear leveling by using different keys for calibration data
//************************************************************************************
void saveCalibrationOffset(float offset) {
  preferences.begin("calibration", false);
  // Implement simple wear leveling by rotating between three keys
  static uint8_t calibKeyIndex = 0;
  const char* CALIB_KEYS[] = {"cal1", "cal2", "cal3"};

  // Save to current key
  preferences.putFloat(CALIB_KEYS[calibKeyIndex], offset);
  // Update key index for next save (rotating between 0,1,2)
  calibKeyIndex = (calibKeyIndex + 1) % 3;
  // Also save to main key for backward compatibility
  preferences.putFloat("offset", offset);

  preferences.end();
  // Update runtime variable immediately
  ACS_OFFSET_VOLTAGE = offset;

  DEBUG_PRINTF("Calibration offset %.3f V saved to Preferences (key: %s)\n",
               offset, CALIB_KEYS[(calibKeyIndex + 2) % 3]); // Show which key was used
}

//************************************************************************************
// Load Calibration Offset (Migrated to Preferences)
// Loads from wear-leveled keys with fallback to main key
//************************************************************************************
bool loadCalibrationOffset() {
  preferences.begin("calibration", true); // Read-only

  // Try wear-leveled keys first, then fall back to main key
  float offset = -99.0f;
  const char* CALIB_KEYS[] = {"cal1", "cal2", "cal3"};

  for (int i = 0; i < 3; i++) {
    float testOffset = preferences.getFloat(CALIB_KEYS[i], -99.0f);
    if (testOffset > 0.5f && testOffset < 4.5f) {
      offset = testOffset;
      DEBUG_PRINTF("Loaded calibration from key %s: %.3f V\n", CALIB_KEYS[i], offset);
      break;
    }
  }

  // If wear-leveled keys failed, try main key
  if (offset < 0.5f || offset > 4.5f) {
    offset = preferences.getFloat("offset", -99.0f);
  }

  preferences.end();

  // Validate the offset is within reasonable range (0.5V to 4.5V)
  if (offset > 0.5f && offset < 4.5f) {
    ACS_OFFSET_VOLTAGE = offset;
    DEBUG_PRINTF("Loaded calibration offset: %.3f V\n", ACS_OFFSET_VOLTAGE);
    return true;
  } else {
    DEBUG_PRINTF("Invalid/No calibration offset in Preferences: %.3f V\n", offset);
    return false;
  }
}

//************************************************************************************
// LCD: Load Custom Icons and Draw Static Anchors (Top Row Labels)
// Creates battery level icons, power icon, and PWM icon for LCD display
//************************************************************************************
void SETUP_POWER_BATT_ICON() {
  // Load custom battery level icons
  for (int batchar = 0; batchar < 6; ++batchar) lcd.createChar(batchar, BATTERY_ICON[batchar]);
  // Load power and PWM icons
  lcd.createChar(POWER_ICON, POWER_ICON_PATTERN);
  lcd.createChar(PWM_ICON, PWM_ICON_PATTERN);

  // Draw static labels on top row
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("POW");
  lcd.setCursor(4, 0); lcd.write(POWER_ICON);
  lcd.setCursor(7, 0); lcd.print("BAT");
  lcd.setCursor(19, 0); lcd.print("C");
  lcd.setCursor(19, 1); lcd.write(PWM_ICON);
}

//************************************************************************************
// Sensor Installation Screen (Startup)
// Displays detection status of DS18B20 and ADS1115 sensors
//************************************************************************************
void ShowSensorInstallationScreen() {
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("Sensor Installation");

