subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
  // Use compatibility macro for v3.0+ support
  COMPAT_LEDC_ATTACH(BATTSTATUS_LED, ledChannel, pwmFrequency, pwmResolution);

  // Ensure PWM and Driver state are safe (OFF)
  writePWMClamped(0);

  // Log PWM configuration for debugging
  DEBUG_PRINTF("PWM Configuration: User Limit = %d%% (%d/1023)\n",
               PWM_FULL_SCALE_LIMIT, PWM_MAX_DUTY);
  DEBUG_PRINTF("IR2104 Bootstrap Safety: Low-side ON time = %d%% of cycle\n",
               100 - PWM_FULL_SCALE_LIMIT);

  ds18b20.begin();
  ds18b20Found = ds18b20.getAddress(ds18b20Addr, 0);
  if (ds18b20Found) {
    ds18b20.setResolution(ds18b20Addr, 12);
    ds18b20.setWaitForConversion(false);
    ds18b20.requestTemperatures();
    DEBUG_PRINTLN("DS18B20: Found");
  } else {
    DEBUG_PRINTLN("DS18B20: NOT found");
  }

#if !SIMULATION_MODE
  ads.setGain(GAIN_TWOTHIRDS);
  ads_connected = false;
  for (int attempts = 0; attempts < 5 && !ads_connected; attempts++) {
    ads_connected = ads.begin();
    if (!ads_connected) {
      DEBUG_PRINTF("ADS1115 not detected! Attempt %d\n", attempts + 1);
      lcd.setCursor(0, 0);
      lcd.print("ADS Retry "); lcd.print(attempts + 1);

      // Non-blocking delay
      NonBlockingDelay adsRetryDelay;
      unsigned long retryStart = millis();
      while (millis() - retryStart < 1000) {
        if (adsRetryDelay.isComplete(100)) {
          updateBeepPattern();
          feedWatchdog(); // Feed watchdog during sensor initialization
        }
        delay(10);
      }
    }
  }
  if (!ads_connected) {
    ShowSensorInstallationScreen();
    lcd.clear();
    lcd.setCursor(0, 0);
    lcd.print("ADS1115 not found!");
    DEBUG_PRINTLN("Failed to initialize ADS1115 after 5 attempts.");

    // Non-blocking infinite loop
    NonBlockingDelay errorDelay;
    while (1) {
      if (errorDelay.isComplete(1000)) {
        updateBeepPattern();
        feedWatchdog(); // Feed watchdog in error state
      }
      delay(10);
    }
  }
#else
  ads_connected = true;
#endif

  ShowSensorInstallationScreen();
  if       (ACS712_VARIANT == 5)  ACS_SENSITIVITY = 0.185;
  else if (ACS712_VARIANT == 20) ACS_SENSITIVITY = 0.100;
  else if (ACS712_VARIANT == 30) ACS_SENSITIVITY = 0.066;
  else {
    DEBUG_PRINTLN("Invalid ACS712 variant selected!");
    lcd.setCursor(0, 0); lcd.print("Invalid ACS712 Config");
    // Non-blocking infinite loop
    NonBlockingDelay configErrorDelay;
    while (1) {
      if (configErrorDelay.isComplete(1000)) {
        updateBeepPattern();
        feedWatchdog(); // Feed watchdog in error state
      }
      delay(10);
    }
  }

  // Load battery type from Preferences
  preferences.begin("settings", true);
  uint8_t savedType = preferences.getUChar("batType", 0); // Default to 0
  preferences.end();

  selectedBattery = (BatteryType)savedType;
  if (selectedBattery >= BATTERY_TYPE_COUNT) selectedBattery = LEAD_ACID_12V_7AH;
  currentBattery = batteryTable[selectedBattery];

  batterySelectionMenu();
  writePWMClamped(0);
  // Non-blocking delay
  NonBlockingDelay setupDelay;
  unsigned long setupStart = millis();
  while (millis() - setupStart < 2000) {
    if (setupDelay.isComplete(100)) {
      updateBeepPattern();
      feedWatchdog(); // Feed watchdog during setup
    }
    delay(10);
  }

  // Load calibration offset from Preferences
  if (!loadCalibrationOffset()) {
    DEBUG_PRINTLN("Using default offset: 2.5V");
    ACS_OFFSET_VOLTAGE = 2.5;
  }

#if !SIMULATION_MODE
  autoCalibrationCountdown(); // 10-second window for calibration
#endif

  setupFanPWM();
  SETUP_POWER_BATT_ICON();
  // Non-blocking delay
  NonBlockingDelay finalDelay;
  unsigned long finalStart = millis();
  while (millis() - finalStart < 1000) {
    if (finalDelay.isComplete(100)) {
      updateBeepPattern();
      feedWatchdog(); // Feed watchdog during final setup
    }
    delay(10);
  }

  rebootStartTime = millis();
  lastWatchdogFeed = millis(); // Reset watchdog feed timer

  // Initial system health check
  DEBUG_PRINTF("System initialized. Free heap: %d bytes\n", ESP.getFreeHeap());
  DEBUG_PRINTF("Min free heap: %d bytes\n", ESP.getMinFreeHeap());
}

//************************************************************************************
// Arduino Loop: Main Non-blocking Cycle
// Main execution loop with state machine and periodic tasks
//************************************************************************************
void loop() {
  // Feed the watchdog regularly to prevent reset
  feedWatchdog();
  // Handle all operations with non-blocking delays
  handleWiFiResetButton(); // now in wifi_sys.cpp
  updateBeepPattern();
  handleLoadButtons();
  handleCalibrationButton();
  handleWebServer();
  wifiMaintain(); // now in wifi_sys.cpp

  // Non-blocking IP print every 30 seconds
  if (ipPrintDelay.isComplete(30000)) {
    bool connected = (WiFi.status() == WL_CONNECTED);
    DEBUG_PRINT("WiFi Status: ");
    DEBUG_PRINT(connected ? "Connected" : "Disconnected");
    if (connected) {
      DEBUG_PRINT(" | IP: ");
      DEBUG_PRINT(WiFi.localIP());
      DEBUG_PRINT(" | RSSI: ");
      DEBUG_PRINT(WiFi.RSSI());
      DEBUG_PRINTLN(" dBm");
    } else {
      DEBUG_PRINTLN(" | IP: 0.0.0.0 | RSSI: N/A");
    }
  }

  if (!ads_connected) {
    if (sensorDelay.isComplete(5000)) { // Increased to 5 seconds for recovery attempts
      // Attempt I²C bus recovery before retrying
      recoverI2CBus();
      ads_connected = ads.begin();
      if (!ads_connected) {
        lcd.setCursor(0, 1);
        lcd.print("Retrying ADS...    ");
        DEBUG_PRINTLN("Retrying ADS1115 with bus recovery...");
      } else {
        lcd.clear();
        lcd.setCursor(0, 0); lcd.print("ADS1115 Connected!");
        // Non-blocking delay
        NonBlockingDelay connectedDelay;
        unsigned long connectStart = millis();
        while (millis() - connectStart < 1000) {
          if (connectedDelay.isComplete(100)) {
            updateBeepPattern();
            feedWatchdog(); // Feed watchdog during connection
          }
          delay(10);
        }
      }
    }
    return;
  }

