subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
  // REMOVED: writePWMClamped(pwm_value) - PWM is written ONLY in control logic
  Auto_Reboot_Logic();
  // Run sensors and logic every 100ms to reduce blocking latency
  if (sensorDelay.isComplete(100)) {
    readSensors();
    // CHECK LOAD PROTECTION AFTER READING SENSORS
    checkLoadProtection();
    updateChargeMode();

    // CRITICAL FIX: Call adjustPWM() for active charging modes
    // This ensures PWM is actively controlled regardless of state transitions
    if (mode != BACKUP && mode != IDLE) {
      // Determine target voltage and current based on mode
      float targetVoltage, maxCurrent;
      switch (mode) {
        case BULK:
          targetVoltage = min(bulk_voltage_max, BULK_SAFETY_LIMIT);
          maxCurrent = currentBattery.bulk_current;
          break;
        case ABSORPTION:
          targetVoltage = absorption_voltage_max;
          maxCurrent = currentBattery.absorption_current;
          break;
        case FLOAT:
          targetVoltage = min(float_voltage_max, FLOAT_SAFETY_LIMIT);
          maxCurrent = currentBattery.float_current;
          break;
        default:
          targetVoltage = min(bulk_voltage_max, BULK_SAFETY_LIMIT);
          maxCurrent = currentBattery.bulk_current;
          break;
      }
      adjustPWM(targetVoltage, maxCurrent);
    }

    // Manage Driver SD (Shutdown) pin state
    manageDriverSD();
    updateLoadStatus();
  }

  // Update LCD every 500ms
  if (lcdDelay.isComplete(500)) {
    Update_Main_LCD();
  }

  BattStatusLED_Pulse();
  updateBatteryStatusLED();
  SPINNER_Status();
  Battery_Power_Display();
  // Log data every 1 second
  if (logDelay.isComplete(1000)) {
    logDataToSerial();
  }

  // Monitor system health
  monitorSystemHealth();

  updateFanPWM(temperatureC);
  // Small yield delay to prevent issues in tight loops
  delay(1);
}

//************************************************************************************
// Auto Reboot with 30s Heads-up on LCD
// Automatic system reboot every 24 hours for stability
//************************************************************************************
void Auto_Reboot_Logic() {
  static bool counting = false;
  static unsigned long countdownStart = 0;
  static NonBlockingDelay rebootDelay;

  unsigned long uptime = millis() - rebootStartTime;
  if (!counting && uptime >= REBOOT_INTERVAL - 30000UL) {
    counting = true;
    rebootNotified = true;
    countdownStart = millis();
    DEBUG_PRINTLN("Rebooting system...in 30 Sec");
  }

  if (counting) {
    if (rebootDelay.isComplete(1000)) { // Update every second
      unsigned long elapsed = millis() - countdownStart;
      int remaining = 30 - (elapsed / 1000);
      if (remaining < 0) remaining = 0;

      lcd.setCursor(0, 3);
      lcd.print("Rebooting in " + String(remaining) + "s        ");

      if (elapsed >= 30000UL) {
        lcd.clear();
        lcd.setCursor(0, 0); lcd.print("Rebooting system...");
        DEBUG_PRINTLN("Rebooting now...");
        // Give time for LCD update before reboot
        delay(1000);
        ESP.restart();
      }
    }
  }
}

//************************************************************************************
// Read Sensors (ADS1115 + DS18B20)
// Enhanced with hysteresis for current noise filtering
// Enhanced temperature sensor validation with rate-of-change limits
//************************************************************************************
void readSensors() {
#if SIMULATION_MODE
  input_voltage = 24.00; // 24.0;// 0.0for Testing where no Input Voltage 
  bat_voltage   = 14.40;
  Current_A     = 0.02;
  temperatureC  = 32.0;
  tempValid     = true;
  return;
#endif

  // Read DC input voltage from defined channel
  int16_t raw_input = ads.readADC_SingleEnded(ADS_PIN_INPUT_VOLTAGE);
  float adc_input_V = ads.computeVolts(raw_input);
  float new_input = adc_input_V * dividerFactor;
  // Read battery voltage from defined channel
  int16_t raw_batt = ads.readADC_SingleEnded(ADS_PIN_BATTERY_VOLTAGE);
  float adc_batt_V = ads.computeVolts(raw_batt);
  float new_batt = adc_batt_V * dividerFactor;

  // Apply filtering
  input_voltage = ALPHA_V * new_input + (1 - ALPHA_V) * input_voltage;
  bat_voltage   = ALPHA_V * new_batt  + (1 - ALPHA_V) * bat_voltage;
  // Read current from ACS712 sensor on defined channel
  int16_t raw_I = ads.readADC_SingleEnded(ADS_PIN_CURRENT_SENSOR);
  float v2 = ads.computeVolts(raw_I);
  float current = (v2 - ACS_OFFSET_VOLTAGE) / ACS_SENSITIVITY;
  current += MANUAL_OFFSET_CORRECTION;
  if (current < 0) current = -current;
  // Add hysteresis for noise filtering
  static float lastFilteredCurrent = 0.0f;
  if (fabs(current) < noiseThreshold + NOISE_HYSTERESIS &&
      fabs(lastFilteredCurrent) < noiseThreshold + NOISE_HYSTERESIS) {
    current = 0.0f;
  }
  lastFilteredCurrent = current;

  Current_A = ALPHA_C * current + (1 - ALPHA_C) * Current_A;
  // Temperature sensor reading with enhanced validation
  if (ds18b20Found) {
    if (ds18b20.isConversionComplete()) {
      float tC = ds18b20.getTempC(ds18b20Addr);
      // Temperature validation with rate-of-change limits
      static float lastValidTemp = 25.0f;
      static unsigned long lastTempRead = 0;
      const float MAX_TEMP_RATE_CHANGE = 5.0f; // Max 5°C per second

      if (tC != DEVICE_DISCONNECTED_C && tC > -55.0f && tC < 125.0f) {
        unsigned long now = millis();
        float timeDelta = (now - lastTempRead) / 1000.0f; // Convert to seconds

        // Check for sudden unrealistic changes
        if (timeDelta > 0 && fabs(tC - lastValidTemp) / timeDelta <= MAX_TEMP_RATE_CHANGE) {
          tempValid = true;
          filteredTemp = ALPHA_TEMP * tC + (1.0f - ALPHA_TEMP) * filteredTemp;
          temperatureC = filteredTemp;
          lastValidTemp = tC;
          lastTempRead = now;
        } else {
          // Use filtered value if rate is too high
          temperatureC = filteredTemp;
          tempValid = false;
        }
      } else {
        // Reset filtered temperature on invalid read
        filteredTemp = lastValidTemp; // Keep last known good value
        temperatureC = filteredTemp;
        tempValid = false;
      }
      ds18b20.requestTemperatures();
    }
  } else {
    tempValid = false;
  }
}

//************************************************************************************
// Charge Mode State Machine - v12.0 FULL HYSTERESIS-BASED CONTROLLER
// Implements complete state transitions: BULK → ABSORPTION → FLOAT → BACKUP → IDLE → BULK
// Strict separation: Only handles state transitions, timers, and hysteresis decisions
// All hysteresis values sourced from battery_types.h (no magic numbers)
//************************************************************************************
void updateChargeMode() {
  static unsigned long floatHoldStart = 0UL;
  static unsigned long absorptionHoldStart = 0UL;
  static unsigned long overvoltageStart = 0UL;
  static unsigned long idleStartTime = 0UL;
  static unsigned long idleVoltageDropStart = 0UL;
  unsigned long now = millis();

