subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
  // MODE FLAPPING PREVENTION: Enforce minimum dwell time
  bool canTransition = (now - lastModeChange >= currentBattery.min_mode_time_ms);

  // === IR2104 CHANGE ===
  // When resetting PWM, ensure we respect the synchronous topology.
  // 0 = Low-Side ON (Freewheeling) via Driver.

  // Check if input voltage is sufficient for charging
  if (input_voltage <= input_voltage_min) {
    if (mode != BACKUP) {
      mode = BACKUP;
      // Show (BATT) when load is ON, (B-IDL) when load is OFF
      mode_str = (load_is_on && !loadWasTripped) ? "(BATT)" : "(B-IDL)";
      // Full Reset
      pwm_value = 0; pwm_last = 0; writePWMClamped(pwm_value);
      lastModeChange = now; floatHoldStart = 0; absorptionHoldStart = 0; idleStartTime = 0; idleVoltageDropStart = 0;
      DEBUG_PRINTLN(F("Entering BACKUP mode due to low input voltage"));
    } else {
      // Already in BACKUP mode - update display based on current load status
      mode_str = (load_is_on && !loadWasTripped) ? "(BATT)" : "(B-IDL)";
    }
    return;
  }

  // Exit BACKUP when input voltage is restored
  if (mode == BACKUP && input_voltage > input_voltage_min) {
    mode = BULK;
    mode_str = "(BULK)";
    // Full Reset for Soft Start
    pwm_value = 0; pwm_last = 0; writePWMClamped(0);
    lastModeChange = now; floatHoldStart = 0; absorptionHoldStart = 0; idleStartTime = 0; idleVoltageDropStart = 0;
    DEBUG_PRINTLN(F("Exiting BACKUP -> Restarting from BULK"));
    return;
  }

  // Overvoltage protection - FORCE BACKUP with hard PWM shutdown
  if (bat_voltage >= OVERVOLTAGE_CUTOFF) {
    if (overvoltageStart == 0) overvoltageStart = now;
    if (now - overvoltageStart < 3000) {
      // Rapid PWM reduction during overvoltage
      pwm_value = max(pwm_value - 30, 0); // Increased step for 10-bit range
      writePWMClamped(pwm_value);
      DEBUG_PRINTLN(F("Overvoltage! Reducing PWM..."));
    } else {
      // Persistent overvoltage - force BACKUP
      mode = BACKUP;
      // Show (B-IDL) during overvoltage (safety state, load should be OFF)
      mode_str = "(B-IDL)";
      pwm_value = 0;
      pwm_last = 0;
      writePWMClamped(pwm_value);
      lastModeChange = now; floatHoldStart = 0; absorptionHoldStart = 0; idleVoltageDropStart = 0;
      DEBUG_PRINTLN(F("Overvoltage persists -> Switching to BACKUP!"));
    }
    return;
  } else {
    overvoltageStart = 0;
  }

  // IDLE mode entry (battery fully charged) - FIXED: Only from FLOAT mode
  if (mode == FLOAT && canTransition) {
    // Battery must be at float voltage with low current to enter IDLE
    bool atFloatVoltage = (bat_voltage >= (float_voltage_min - VOLTAGE_HYSTERESIS)) && 
                          (bat_voltage <= (float_voltage_max + VOLTAGE_HYSTERESIS));
    bool lowCurrent = (Current_A <= IDLE_CURRENT_THRESHOLD);
    
    if (atFloatVoltage && lowCurrent) {
      if (idleStartTime == 0) idleStartTime = now;
      // Use battery-specific idle entry time
      if ((now - idleStartTime) >= currentBattery.idle_entry_time_ms) {
        mode = IDLE;
        mode_str = "(IDLE)";
        pwm_value = 0; pwm_last = 0; writePWMClamped(0);
        lastModeChange = now; floatHoldStart = 0; absorptionHoldStart = 0; idleVoltageDropStart = 0;
        DEBUG_PRINTLN(F("Entering IDLE mode (battery fully charged)"));
        return;
      }
    } else {
      idleStartTime = 0; // Reset timer if conditions no longer met
    }
  } else if (mode != IDLE) {
    idleStartTime = 0; // Reset timer if not in FLOAT mode
  }

  // IDLE mode management - requires voltage + time hysteresis to exit
  if (mode == IDLE) {
    if (bat_voltage <= (float_voltage_min - VOLTAGE_HYSTERESIS)) {
      if (idleVoltageDropStart == 0) idleVoltageDropStart = now;
      // Use battery-specific idle exit time
      if ((now - idleVoltageDropStart) >= currentBattery.idle_exit_time_ms) {
        mode = BULK;
        mode_str = "(BULK)";
        lastModeChange = now;
        idleStartTime = 0;
        idleVoltageDropStart = 0;
        floatHoldStart = 0;
        absorptionHoldStart = 0;
        DEBUG_PRINTLN(F("IDLE -> BULK: Battery voltage low for specified time"));
        return;
      }
    } else {
      idleVoltageDropStart = 0;
    }

    if (Current_A > (IDLE_CURRENT_THRESHOLD + CURRENT_HYSTERESIS)) {
      mode = BULK;
      mode_str = "(BULK)";
      lastModeChange = now;
      idleStartTime = 0;
      idleVoltageDropStart = 0;
      floatHoldStart = 0;
      absorptionHoldStart = 0;
      DEBUG_PRINTLN(F("Exiting IDLE mode (current increased)"));
      return;
    }

    pwm_value = 0; pwm_last = 0; writePWMClamped(0);
    return;
  }

  // MAIN STATE TRANSITIONS
  switch (mode) {
    case BULK:
      if (canTransition) {
        bool reachedV = (bat_voltage >= (bulk_voltage_max + VOLTAGE_HYSTERESIS));
        if (reachedV) {
          mode = ABSORPTION;
          mode_str = "(ABSO)";
          lastModeChange = now;
          floatHoldStart = 0;
          absorptionHoldStart = 0;
          DEBUG_PRINTLN(F("Transition: BULK -> ABSORPTION"));
        }
      }
      break;
    case ABSORPTION:
      if (canTransition) {
        bool atV = (bat_voltage >= absorption_voltage_max);
        bool atI = (Current_A <= (currentBattery.absorption_current + CURRENT_HYSTERESIS));
        if (atV && atI) {
          if (absorptionHoldStart == 0) {
            absorptionHoldStart = now;
            DEBUG_PRINTLN(F("Absorption hold timer started"));
          } else if (now - absorptionHoldStart >= currentBattery.absorption_time_ms) {
            // Use battery-specific absorption time
            mode = FLOAT;
            mode_str = "(FLOT)";
            lastModeChange = now;
            floatHoldStart = 0;
            absorptionHoldStart = 0;
            DEBUG_PRINTLN(F("Transition: ABSORPTION -> FLOAT"));
          }
        } else {
          absorptionHoldStart = 0;
        }
      }
      break;
    case FLOAT:
      if (canTransition) {
        // SAFE FLOAT EXIT: Requires voltage drop below min with hysteresis
        bool lowV = (bat_voltage < (float_voltage_min - VOLTAGE_HYSTERESIS));
        bool highI = (Current_A > (currentBattery.float_current + CURRENT_HYSTERESIS));
        if (lowV || highI) {
          if (floatHoldStart == 0) {
            floatHoldStart = now;
            DEBUG_PRINTLN(F("Float exit timer started (V or I out of range)"));
          } else if (now - floatHoldStart >= currentBattery.float_exit_time_ms) {
            // Use battery-specific float exit time
            mode = BULK;
            mode_str = "(BULK)";
            lastModeChange = now;
            floatHoldStart = 0;
            absorptionHoldStart = 0;
            DEBUG_PRINTLN(F("Transition: FLOAT -> BULK"));
          }
        } else {
          floatHoldStart = 0;
        }
      }
      break;
    default:
      break;
  }
}
//************************************************************************************
// Adjust PWM Based on Voltage/Current Error (CC/CV Algorithm)
// Fixed-step control for stability with noisy ADC and inductive components
// All hysteresis values sourced from battery_types.h (no magic numbers)
//************************************************************************************
void adjustPWM(float targetVoltage, float maxCurrent) {
  if (mode == BACKUP || mode == IDLE) {
    pwm_value = 0;
    pwm_last = 0;
    writePWMClamped(pwm_value);
    return;
  }

  // SOFT-START RE-TRIGGER PREVENTION: Execute only once per charge cycle
  static bool softStartDone = false;
  if (mode == BACKUP || mode == IDLE) {
    softStartDone = false;
  }

  // CURRENT-QUALIFIED SOFT START: Don't ramp unless current is flowing
  const float SOFTSTART_MIN_CURRENT = 0.01f; // Lower to 10mA for smoother startup
  if (!softStartDone && Current_A < SOFTSTART_MIN_CURRENT) {
    // Don't start soft-start unless we see some current
    pwm_value = 20;
    pwm_last  = 20;
    writePWMClamped(20);   // allow tiny PWM to detect current
    return;
  }
  softStartDone = true;

  // Surge current protection with timing control
  unsigned long now = millis();
  if (now - lastPWMChange < MIN_PWM_CHANGE_INTERVAL) {
    return; // Skip PWM update too soon
  }

  // Rate limiting based on current
  const float currentRampRate = 0.8f; // Slower ramp rate for stability
  float maxDeltaCurrent = currentRampRate * (MIN_PWM_CHANGE_INTERVAL / 1000.0f);
  if (fabs(Current_A - lastCurrent) > maxDeltaCurrent) {
    // Current changing too fast - limit PWM change
    int maxPWMDelta = 2; // HALVED: 2 instead of 4
    if (pwm_value > lastPWMValue) {
      pwm_value = min(lastPWMValue + maxPWMDelta, pwm_value);
    } else {
      pwm_value = max(lastPWMValue - maxPWMDelta, pwm_value);
    }
  }

  lastCurrent = Current_A;
  lastPWMValue = pwm_value;
  lastPWMChange = now;

  // === IR2104 CHANGE ===
  // ANTI-COLLAPSE PROTECTION
  // In a Synchronous Buck, if Input < Bat, we must NOT switch,
  // otherwise we might boost current backwards from Bat to Input
  // (depending on diode configuration).
  // Force OFF if input headroom is gone.
  //  if (input_voltage < (bat_voltage + 0.5f)) { // Tightened threshold
  //    pwm_value = 0; // Force Low-Side ON (Freewheel/Block)

