subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
  if (input_voltage < (bat_voltage + 1.5f)) { // Looser threshold
    pwm_value = max(pwm_value - 20, 0); // Gradual reduction instead of hard cutoff


    pwm_last = 0;
    writePWMClamped(pwm_value);
    return;
  }

  // Detect if we are close to collapsing to inhibit aggressive PWM increases
  bool nearCollapse = (input_voltage < (bat_voltage + 2.0));

  // MODE-SPECIFIC ABSOLUTE VOLTAGE SAFETY: Use correct safety limit based on mode
  float currentSafetyLimit = BULK_SAFETY_LIMIT;
  if (mode == FLOAT) {
    currentSafetyLimit = FLOAT_SAFETY_LIMIT;
  }

  // SAFETY OVERRIDE ENFORCEMENT: Check absolute maximum limits
  if (bat_voltage > currentSafetyLimit || Current_A > maxCurrent * 1.5f) {
    // Safety violation - reduce PWM aggressively and freeze PWM increase
    pwm_value = max(pwm_value - 30, 0);
    writePWMClamped(pwm_value);
    return; // Freeze PWM increase while safety violation exists
  }

  // === IR2104 CHANGE ===
  // Updated Control Limit to user-defined percentage
  const int SAFETY_MAX_PWM = PWM_MAX_DUTY;

  // FIXED-STEP CONTROL: Small fixed steps for stability (no magic numbers)
  const int PWM_STEP_UP = 1;      // HALVED: 1 instead of 8 (0.1% of full scale)
  const int PWM_STEP_DOWN = 2;    // HALVED: 2 instead of 4 (0.2% of full scale)
  const int PWM_STEP_SAFETY = 64; // Large step for safety violations (6.3% of full scale)

  // FIXED-STEP LOGIC: Determine if we need more or less power
  bool need_more_power = false;
  bool need_less_power = false;

  if (mode == BULK) {
    // CONSTANT CURRENT MODE: Target is current, not voltage
    float currentError = maxCurrent - Current_A;

    if (currentError > 0.2f) {
      // Need more current - increase PWM with fixed step
      need_more_power = true;
    } else if (currentError < -0.1f) {
      // Need less current - decrease PWM with fixed step
      need_less_power = true;
    }

    // Voltage ceiling check for CC mode
    if (bat_voltage > bulk_voltage_max) {
      need_less_power = true; // Voltage too high in CC mode
    }

  } else {
    // CONSTANT VOLTAGE MODE (Absorption/Float): Target is voltage
    float voltageError = targetVoltage - bat_voltage;

    if (voltageError > 0.1f) {
      // Voltage below target - increase PWM with fixed step
      need_more_power = true;
    } else if (voltageError < -0.05f) {
      // Voltage above target - decrease PWM with fixed step
      need_less_power = true;
    }

    // Current ceiling in CV mode
    if (Current_A > maxCurrent) {
      need_less_power = true; // Current too high in CV mode
    }
  }

  // FIXED-STEP EXECUTION: Apply small fixed steps
  if (need_more_power) {
    pwm_value += PWM_STEP_UP;      // small fixed step up
    DEBUG_PRINTF("Fixed-step: Need more power. PWM: %d\n", pwm_value);
  }
  else if (need_less_power) {
    pwm_value -= PWM_STEP_DOWN;    // small fixed step down
    DEBUG_PRINTF("Fixed-step: Need less power. PWM: %d\n", pwm_value);
  }

  // Smooth limiting using global pwm_last (The ramping controller)
  int delta = pwm_value - pwm_last;
  if (delta > 16) { // Scaled x4
    pwm_value = pwm_last + 16; // Absolute safety cap on rate of rise
  } else if (delta < -16) { // Scaled x4
    pwm_value = pwm_last - 16;
  }

  // === IR2104 CHANGE ===
  // Ensure the control variable never exceeds the user-defined limit
  pwm_value = constrain(pwm_value, 0, SAFETY_MAX_PWM);
  pwm_last = pwm_value;
  writePWMClamped(pwm_value);
}



//************************************************************************************
// Load Control Policy (AUTO mode)
// Simple rule ONLY:
// - Input power removed (below input_voltage_min) → LOAD ON
// - Input power present → LOAD OFF
// Battery low, overload, debounce logic preserved
//************************************************************************************
void updateLoadStatus() {

  if (loadControlMode != AUTO) {
    if (pendingLoadChange) finalizeLoadToggle();
    return;
  }

  if (tempLoadOn) {
    if (pendingLoadChange) finalizeLoadToggle();
    return;
  }

  unsigned long now = millis();

  if ((now - lastLoadChangeTime) >= debounceDelay &&
      !pendingLoadChange &&
      !loadWasTripped) {

    // Detect input power
    bool inputMissing = (input_voltage < input_voltage_min);

    // Battery safety
    bool battSafeOn    = (bat_voltage >= (battery_voltage_hysteresis + battery_voltage_min));
    bool battTooLowOff = (bat_voltage <  (battery_voltage_min - battery_voltage_hysteresis));

    // FINAL LOAD DECISION (ONLY input based)
    bool shouldTurnOnLoad  = (!load_is_on && inputMissing && battSafeOn);
    bool shouldTurnOffLoad = ( load_is_on && (!inputMissing || battTooLowOff) );

    if (shouldTurnOnLoad || shouldTurnOffLoad) {
      nextToggleIsManual = false;
      scheduleLoadToggle(shouldTurnOnLoad);
    }
  }

  if (pendingLoadChange) finalizeLoadToggle();
}



//************************************************************************************
// Breathing LED (Maps Brightness/Pulse Speed to Voltage)
// Enhanced algorithm with smoother animation using sine wave modulation
//************************************************************************************
void BattStatusLED_Pulse() {
  static unsigned long lastPulseUpdate = 0;
  static float pulsePhase = 0.0;
  unsigned long now = millis();
  // Update every 25ms for smoother animation
  if (now - lastPulseUpdate < 25) return;
  lastPulseUpdate = now;

  // Convert battery voltage to millivolts for processing
  int voltage_mV = bat_voltage * 1000;
  // Turn off LED for critically low voltage
  if (voltage_mV <= 8500) {
    // Use compatibility macro for v3.0+ support
    COMPAT_LEDC_WRITE(BATTSTATUS_LED, ledChannel, 0);
    return;
  }

  // Full brightness for very high voltage
  if (voltage_mV > 13700) {
    // Use compatibility macro for v3.0+ support
    COMPAT_LEDC_WRITE(BATTSTATUS_LED, ledChannel, 255);
    return;
  }

