subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
  // Constrain voltage to operational range
  voltage_mV = constrain(voltage_mV, 8000, 14000);
  // Calculate voltage ratio for dynamic behavior
  float voltageRatio = (voltage_mV - 8000) / float(14000 - 8000);
  // Dynamic brightness range based on voltage
  int brightnessMax = 180 + voltageRatio * (255 - 180); // 180-255 range
  int baseBrightness = 10;  // Minimum brightness to avoid complete darkness
  int pulseAmplitude = brightnessMax - baseBrightness;
  // Variable pulse speed - higher voltage = faster pulse
  float speedFactor = 0.015 + voltageRatio * 0.045; // 0.015-0.06 range
  pulsePhase += speedFactor;
  if (pulsePhase > TWO_PI) pulsePhase -= TWO_PI;
  // Sine wave modulation for smooth breathing effect
  float sineValue = (sin(pulsePhase) + 1.0) / 2.0;
  int pwmValue = baseBrightness + sineValue * pulseAmplitude;

  // Apply PWM to breathing LED using compatibility macro
  COMPAT_LEDC_WRITE(BATTSTATUS_LED, ledChannel, pwmValue);
}

//************************************************************************************
// Update Battery Status LEDs and LCD Display
// Uses battery-type-specific thresholds for accurate LED indication
//************************************************************************************
void updateBatteryStatusLED() {
  const int pct = constrain(getBatteryPercentage(bat_voltage), 0, 100);
  // Determine battery-type-specific thresholds for LED indication
  int crit_threshold, warn_threshold, good_threshold;
  switch (selectedBattery) {
    case LEAD_ACID_12V_7AH:
      crit_threshold = 20; // 20% for Lead Acid
      warn_threshold = 50; // 50% for Lead Acid
      good_threshold = 95; // 95% for Lead Acid
      break;

    case LIFEPO4_12V:
      crit_threshold = 10; // 10% for LiFePO4 (more aggressive protection)
      warn_threshold = 30; // 30% for LiFePO4
      good_threshold = 90; // 90% for LiFePO4
      break;

    case LIION_3S:
      crit_threshold = 15; // 15% for Li-ion (aggressive protection)
      warn_threshold = 25; // 25% for Li-ion
      good_threshold = 85; // 85% for Li-ion
      break;

    default:
      crit_threshold = 20;
      warn_threshold = 50;
      good_threshold = 95;
      break;
  }

  const bool critByVoltage = (bat_voltage <= (battery_voltage_min + CRIT_BATT_WARN_MARGIN));
  const bool critical = critByVoltage || (pct <= crit_threshold);

  bool criticalOn = false;
  bool mediumOn = false;
  bool fullOn = false;
  bool criticalFlash = false;
  bool mediumFlash = false;
  bool fullFlash = false;

  if (pct <= crit_threshold) {
    criticalOn = true;
    criticalFlash = true;
  } else if (pct <= warn_threshold) {
    criticalOn = true;
    mediumOn = true;
    mediumFlash = true;
  } else if (pct <= good_threshold) {
    criticalOn = true;
    mediumOn = true;
    fullOn = true;
    fullFlash = true;
  } else {
    criticalOn = true;
    mediumOn = true;
    fullOn = true;
  }

  static unsigned long lastFlashMillis = 0;
  const unsigned long FLASH_CYCLE_MS = 2000UL;
  const unsigned long FLASH_ON_DURATION_MS = 1000UL;
  const unsigned long now = millis();
  unsigned long elapsed = now - lastFlashMillis;

  bool shouldToggle = (elapsed >= FLASH_CYCLE_MS);
  if (shouldToggle) {
    lastFlashMillis = now;
  }

  bool flashState = (elapsed < FLASH_ON_DURATION_MS);
  digitalWrite(LED_CRITICAL, criticalOn && (!criticalFlash || flashState) ? HIGH : LOW);
  digitalWrite(LED_MEDIUM,   mediumOn && (!mediumFlash || flashState) ? HIGH : LOW);
  digitalWrite(LED_FULL,     fullOn && (!fullFlash || flashState) ? HIGH : LOW);

  const char* statusText;
  if (pct <= crit_threshold) {
    statusText = "{Crit}";
  } else if (pct <= warn_threshold) {
    statusText = "{Warn}";
  } else if (pct <= good_threshold) {
    statusText = "{Good}";
  } else {
    statusText = "{Full}";
  }

  lcd.setCursor(7, 2);
  lcd.print(statusText);
  int pad = 8 - strlen(statusText);
  while (pad-- > 0) lcd.print(' ');

  static bool wasCritical = false;
  static unsigned long lastBuzzerMillis = 0;
  const unsigned long CRIT_BEEP_PERIOD_MS = 60000UL;

  if (pct <= crit_threshold) {
    if (!wasCritical || (now - lastBuzzerMillis >= CRIT_BEEP_PERIOD_MS)) {
      playCriticalBeep();
      lastBuzzerMillis = now;
    }
  }

  wasCritical = (pct <= crit_threshold);
}

//************************************************************************************
// LCD Update (Throttled)
// Updates display with system status information using proper battery voltage mapping
// Uses battery-type-specific voltage ranges for accurate icon display
// Includes division by zero guard for duty calculation
//************************************************************************************
void Update_Main_LCD() {
  // Throttle LCD updates to prevent flickering and reduce processing overhead
  if (millis() - last_lcd_update < LCD_REFRESH_RATE_MS) return;
  last_lcd_update = millis();

  // Map battery voltage to icon index (0-5) using battery-type-specific range
  int battLevelIndex;
  float min_volt, max_volt;
  switch (selectedBattery) {
    case LEAD_ACID_12V_7AH:
      min_volt = 10.5f;
      max_volt = 12.7f;
      break;
    case LIFEPO4_12V:
      min_volt = 10.0f;
      max_volt = 13.5f;
      break;
    case LIION_3S:
      min_volt = 9.0f;
      max_volt = 12.6f;
      break;
    default:
      min_volt = MIN_BATTERY_VOLTAGE;
      max_volt = MAX_BATTERY_VOLTAGE;
      break;
  }

  battLevelIndex = (int)((bat_voltage - min_volt) * 5.0 / (max_volt - min_volt));
  battLevelIndex = constrain(battLevelIndex, 0, 5);

  // Display battery level icon in top right corner
  lcd.setCursor(11, 0); lcd.write(battLevelIndex);
  // Display temperature with degree symbol in top right corner
  lcd.setCursor(15, 0);
  if (tempValid) {
    int roundedTemp = round(temperatureC);
    lcd.print(roundedTemp);
  } else {
    lcd.print("--");
  }
  lcd.write(223); // Degree symbol (°)

  // Display power or battery icon based on input voltage availability
  lcd.setCursor(0, 2);
  if (input_voltage <= input_voltage_min) {
    // Low input voltage - show battery icon
    lcd.write(battLevelIndex);
    if (!rebootNotified) {
      lcd.setCursor(0, 3);
      lcd.write(battLevelIndex);
    }
  } else {
    // Adequate input voltage - show power icon
    lcd.write(POWER_ICON);
    if (!rebootNotified) {
      lcd.setCursor(0, 3);
      lcd.write(POWER_ICON);
    }
  }

  // Display input and battery voltages with 2 decimal places
  lcd.setCursor(0, 1);
  lcd.print(input_voltage, 2);
  lcd.print("v ");
  lcd.setCursor(7, 1); lcd.print(bat_voltage, 2); lcd.print("v    ");
  // === IR2104 CHANGE ===
  // Display % relative to the user-defined safety limit (PWM_MAX_DUTY)
  // User sees 100% when system is at max allowed power (user-defined %)
  int maxDuty = PWM_MAX_DUTY;
  // Division by zero guard with proper implementation
  int dutyPct = 0;
  if (maxDuty > 0) {
    dutyPct = (pwm_value * 100) / maxDuty;
    dutyPct = constrain(dutyPct, 0, 100); // Ensure within bounds
  }

