subashsaraf/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0/ESP32_Universal_CC-CV_Charger_Controllerv_v12.0.ino
  lcd.setCursor(15, 1);
  lcd.print("   "); // Fixed-width clear

  // Display PWM duty percentage
  lcd.setCursor(15, 1);
  lcd.print(dutyPct);
  lcd.print("%");
  // Display current in amps (A) or milliamps (mA) based on magnitude
  lcd.setCursor(1, 2);
  if (Current_A >= 1.0) {
    lcd.print(Current_A, 2);
    lcd.print("A ");
  } else {
    lcd.print(Current_A * 1000, 0);
    lcd.print("mA ");
  }

  // Display battery percentage and battery level icon using battery-type-specific calculation
  lcd.setCursor(15, 2); lcd.print(getBatteryPercentage(bat_voltage)); lcd.print("% ");
  lcd.setCursor(19, 2); lcd.write(battLevelIndex);

  // Toggle mode visibility every second for flashing effect
  if (millis() - last_flash_update >= 1000) {
    last_flash_update = millis();
    mode_visible = !mode_visible;
  }

  // Display WiFi connection status with blinking indicator when connected
  {
    static unsigned long lastWiFiBlink = 0;
    static bool wifiBlink = false;
    if (WiFi.status() == WL_CONNECTED) {
      // Blink WiFi indicator every 400ms when connected
      if (millis() - lastWiFiBlink >= 400) {
        lastWiFiBlink = millis();
        wifiBlink = !wifiBlink;
      }
      lcd.setCursor(13, 0); lcd.print(wifiBlink ? "!" : " ");
    } else {
      // Clear WiFi indicator when disconnected
      lcd.setCursor(13, 0);
      lcd.print(" ");
    }
  }

  // Display mode, load status, and control mode on bottom line (unless reboot countdown active)
  if (!rebootNotified) {
    lcd.setCursor(7, 3);
    // Flash mode string on/off for visibility
    if (mode_visible) lcd.print(mode_str);
    else lcd.print("        ");
    lcd.setCursor(15, 3);
    if (loadWasTripped) {
      lcd.print("off");
    } else {
      lcd.print(load_status);
    }
    lcd.setCursor(19, 3);
    if (loadProtectionEnabled && loadWasTripped) {
      lcd.print("P"); // Protection active/tripped
    } else {
      lcd.print(loadControlModeStr);
    }
  }
}

//************************************************************************************
// Spinner (Visual Activity Indicator)
// Provides visual feedback of system activity
//************************************************************************************
void SPINNER_C() {
  static uint8_t index = 0;
  const char spinner_chars[] = { '*', '*', '*', ' ', ' ' };
  lcd.setCursor(12, 0); lcd.print(spinner_chars[index++ % sizeof(spinner_chars)]);
}
void SPINNER_X() {
  static uint8_t index = 0;
  const char spinner_chars[] = { 'X', 'X', 'X', ' ', ' ' };
  lcd.setCursor(12, 0); lcd.print(spinner_chars[index++ % sizeof(spinner_chars)]);
}
void SPINNER_Status() {
  static unsigned long lastUpdate = 0;
  const unsigned long interval = 300;
  if (millis() - lastUpdate >= interval) {
    lastUpdate = millis();
    if (pwm_value > 0) SPINNER_C(); else SPINNER_X();
  }
}

//************************************************************************************
// Power Readout (W): Input when Present, Battery Otherwise
// Displays real-time power consumption or generation
//************************************************************************************
void Battery_Power_Display() {
  if (rebootNotified) return;
  lcd.setCursor(1, 3);

  const float POWER_THRESHOLD = 0.02f;

  if (input_voltage > input_voltage_min) {
    // Input is available - show input power
    float inputPower = Current_A * input_voltage;
    if (inputPower >= POWER_THRESHOLD) {
      lcd.print(inputPower, 1); lcd.print("W ");
    } else {
      lcd.print(" 0.0W ");
    }
  } else {
    // No input - show battery power consumption (no negative sign)
    float batteryPower = Current_A * bat_voltage;
    if (batteryPower >= POWER_THRESHOLD) {
      lcd.print(batteryPower, 1); lcd.print("W ");
    } else {
      lcd.print(" 0.0W ");
    }
  }
}

//************************************************************************************
// Serial Logs (Rate-limited to 1 Hz)
// Includes division by zero guard in duty calculation for safety
//************************************************************************************
void logDataToSerial() {
  static unsigned long last = 0;
  const unsigned long period = 1000;
  if (millis() - last < period) return;
  last = millis();

  DEBUG_PRINT("["); DEBUG_PRINT(millis() / 1000);
  DEBUG_PRINT("s] ");
  DEBUG_PRINT("Input V: "); DEBUG_PRINT(input_voltage, 2); DEBUG_PRINT(" V  ");
  DEBUG_PRINT("Batt V: ");  DEBUG_PRINT(bat_voltage, 2); DEBUG_PRINT(" V  ");
  DEBUG_PRINT("Current: "); DEBUG_PRINT(Current_A, 2); DEBUG_PRINT(" A  ");

  // === IR2104 CHANGE ===
  // Log % relative to user-defined limit
  int maxDuty = PWM_MAX_DUTY;
  // Division by zero guard
  int dutyPct = 0;
  if (maxDuty > 0) {
    dutyPct = (pwm_value * 100) / maxDuty;
    dutyPct = constrain(dutyPct, 0, 100);
  }

  DEBUG_PRINT("PWM: ");     DEBUG_PRINT(dutyPct);           DEBUG_PRINT("%  ");
  DEBUG_PRINT("(Limit: ");  DEBUG_PRINT(PWM_FULL_SCALE_LIMIT); DEBUG_PRINT("%)  ");

  // Assumes fan_control.h exposes getFanDuty() and FAN_MAX_DUTY
  int fanDutyPct = (getFanDuty() * 100) / FAN_MAX_DUTY;
  DEBUG_PRINT("FanPWM: ");  DEBUG_PRINT(fanDutyPct);
  DEBUG_PRINT("%  ");
  DEBUG_PRINT("Temp: ");    DEBUG_PRINT(temperatureC, 1);  DEBUG_PRINT(" °C  ");
  DEBUG_PRINT("Mode: ");    DEBUG_PRINT(mode_str);         DEBUG_PRINT("  ");
  DEBUG_PRINT("Load: ");    DEBUG_PRINT(load_status);
  DEBUG_PRINT(" | LoadMode: "); DEBUG_PRINT(loadControlModeStr);

  DEBUG_PRINT(" | Calib: "); DEBUG_PRINT(ACS_OFFSET_VOLTAGE, 3); DEBUG_PRINTLN(" V");
}
